app/views/trainings/_form.html.erb

    <%= f.label :institution_id, "Institucion a Cargo" %>
    <%= f.select(:institution_id, options_for_select(Institution.all.pluck(:name, :id)))%>
---
SELECT "institutions"."name", "institutions"."id" FROM "institutions"