app/views/employees/_form.html.erb

                  <%= f.select(:work_structure_id) do %>
                    <% WorkStructure.all.each do |a| -%>
---
SELECT "work_structures".* FROM "work_structures"