app/views/employees/_table.html.erb

SELECT  "work_structures".* FROM "work_structures" WHERE "work_structures"."id" = $1 LIMIT 1  [["id", 1]]
---
        <td>
          <% if(f.work_structure_id && WorkStructure.find(f.work_structure_id)) %>