app/controllers/abilities_controller.rb

  def create
    @ability = Ability.new(abilities_params)

    if @ability.save
---
INSERT INTO "abilities" ("ability") VALUES ($1) RETURNING "id"  [["ability", "Test para Oficina"]]