app/controllers/educations_controller.rb

  def new
    @employee = Employee.find(params[:employee_id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @employee = Employee.find(params[:employee_id])
    @education = @employee.educations.build(educations_params)

    if @education.save
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "educations" ("school_name", "title_description", "completed", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["school_name", "sadasd"], ["title_description", ""], ["completed", "f"], ["employee_id", 1], ["created_at", "2017-02-23 19:19:06.818656"], ["updated_at", "2017-02-23 19:19:06.818656"]]