app/controllers/employee_abilities_controller.rb

  def create
    @employee = Employee.find(params[:employee_id])
    @employee_ability = @employee.employee_abilities.build(employee_abilities_params)

    if @employee_ability.save
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "employee_abilities" ("employee_id", "ability_id") VALUES ($1, $2) RETURNING "id"  [["employee_id", 1], ["ability_id", 1]]