app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE (employee_status = true) AND (name LIKE '%Edgar%')
---
  def index
    @employees = Employee.where('employee_status = true')

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 0]]
SELECT "work_structures".* FROM "work_structures"
SELECT  "work_structures".* FROM "work_structures" WHERE "work_structures"."id" = $1 LIMIT 1  [["id", 0]]
SELECT "abilities"."ability", "abilities"."id" FROM "abilities" INNER JOIN "work_structure_abilities" ON "abilities"."id" = "work_structure_abilities"."ability_id" WHERE "work_structure_abilities"."work_structure_id" = $1  [["work_structure_id", 1]]
SELECT "dependants".* FROM "dependants" WHERE "dependants"."employee_id" = $1  [["employee_id", 1]]
SELECT "educations".* FROM "educations" WHERE "educations"."employee_id" = $1  [["employee_id", 1]]
SELECT "abilities".* FROM "abilities"
---
  def show
    @employee = Employee.find(params[:id])
    @education = @employee.educations.build
    @work_exp = @employee.work_exps.build
    @ability =  @employee.abilities.build
    @dependant = @employee.dependants.build
    @permission = @employee.permissions.build
    @work_structures = WorkStructure.all
    @employee_ability = @employee.employee_abilities.build
    @hour = @employee.hours.build
    @work_structure_of_employee = WorkStructure.find_by_id(@employee.work_structure_id)
    @abilities_training = @employee.employee_abilities.all

INSERT INTO "employees" ("name", "profession", "email", "cellphone", "birth_at", "birth_place", "work_id", "date_admission", "RAP_code", "gender", "address", "identity_number", "base_belong", "contract_type", "civil_status", "bank_account", "blood_type", "emergency_contact_name", "emergency_contact_number", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)
    @employee.RAP_code = @employee.identity_number

    if @employee.save

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "employees" SET "supression_motive" = $1, "employee_status" = $2, "supression_date" = $3, "updated_at" = $4 WHERE "employees"."id" = $5  [["supression_motive", "sdgdfhggfsdh"], ["employee_status", "f"], ["supression_date", "2017-05-09 00:00:00.000000"], ["updated_at", "2017-05-09 15:16:08.794346"], ["id", 1]]
---
  def update
    @employee = Employee.find(params[:id])
    @employee.RAP_code = @employee.identity_number

    if @employee.update_attributes(employee_params)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", nil]]
---
  def suprimir
    @employee = Employee.find(params[:id])

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "employees" SET "employee_status" = 't' WHERE "employees"."id" = $1  [["id", 1]]
---
  def reactivar
    @employee = Employee.find(params[:id])
    if @employee.update_column(:employee_status, true)