app/controllers/work_structures_controller.rb

  def index
    @work_structures = WorkStructure.all
---
SELECT "work_structures".* FROM "work_structures"

  def show
    @work_structure = WorkStructure.find(params[:id])
---
SELECT  "work_structures".* FROM "work_structures" WHERE "work_structures"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @work_structure = WorkStructure.new(work_structure_params)

    if @work_structure.save
---
INSERT INTO "work_structures" ("department", "area", "sub_area", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["department", "Oficina"], ["area", "Ventas"], ["sub_area", "Campo"], ["created_at", "2017-02-23 17:55:34.765009"], ["updated_at", "2017-02-23 17:55:34.765009"]]